; domain
(define (domain Depot)
(:requirements :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z))))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))

)

; problem
(define (problem depotprob1916) (:domain Depot)
(:objects
	depot0 depot1 - Depot
	distributor0 distributor1 - Distributor
	truck0 truck1 truck2 truck3 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate13)
	(at pallet1 depot1)
	(clear crate11)
	(at pallet2 distributor0)
	(clear crate14)
	(at pallet3 distributor1)
	(clear crate10)
	(at pallet4 depot0)
	(clear pallet4)
	(at pallet5 distributor0)
	(clear crate8)
	(at pallet6 distributor1)
	(clear crate3)
	(at pallet7 depot1)
	(clear crate5)
	(at truck0 depot1)
	(at truck1 distributor0)
	(at truck2 depot0)
	(at truck3 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 distributor0)
	(available hoist2)
	(at hoist3 distributor1)
	(available hoist3)
	(at hoist4 distributor0)
	(available hoist4)
	(at hoist5 depot0)
	(available hoist5)
	(at hoist6 distributor0)
	(available hoist6)
	(at hoist7 distributor1)
	(available hoist7)
	(at crate0 depot0)
	(on crate0 pallet0)
	(at crate1 depot1)
	(on crate1 pallet1)
	(at crate2 distributor0)
	(on crate2 pallet2)
	(at crate3 distributor1)
	(on crate3 pallet6)
	(at crate4 depot0)
	(on crate4 crate0)
	(at crate5 depot1)
	(on crate5 pallet7)
	(at crate6 distributor0)
	(on crate6 pallet5)
	(at crate7 depot0)
	(on crate7 crate4)
	(at crate8 distributor0)
	(on crate8 crate6)
	(at crate9 distributor1)
	(on crate9 pallet3)
	(at crate10 distributor1)
	(on crate10 crate9)
	(at crate11 depot1)
	(on crate11 crate1)
	(at crate12 distributor0)
	(on crate12 crate2)
	(at crate13 depot0)
	(on crate13 crate7)
	(at crate14 distributor0)
	(on crate14 crate12)
)

(:goal (and
		(on crate0 crate10)
		(on crate1 pallet6)
		(on crate2 crate12)
		(on crate4 pallet4)
		(on crate5 pallet2)
		(on crate6 pallet7)
		(on crate8 crate4)
		(on crate9 crate1)
		(on crate10 pallet1)
		(on crate11 pallet5)
		(on crate12 crate5)
		(on crate13 pallet3)
		(on crate14 pallet0)
	)
)
(:metric minimize (total-time)))

; plan
1. (drive truck3 depot1 depot0)
   deleted: (at truck3 depot1)
   added: (at truck3 depot0)
   goals met: 0 of 13
2. (lift hoist3 crate3 pallet6 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist3) (on crate3 pallet6)
   added: (lifting hoist3 crate3) (clear pallet6)
   goals met: 0 of 13
3. (drive truck3 depot0 distributor1)
   deleted: (at truck3 depot0)
   added: (at truck3 distributor1)
   goals met: 0 of 13
4. (lift hoist7 crate10 crate9 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist7) (on crate10 crate9)
   added: (lifting hoist7 crate10) (clear crate9)
   goals met: 0 of 13
5. (lift hoist1 crate11 crate1 depot1)
   deleted: (at crate11 depot1) (clear crate11) (available hoist1) (on crate11 crate1)
   added: (lifting hoist1 crate11) (clear crate1)
   goals met: 0 of 13
6. (lift hoist0 crate13 crate7 depot0)
   deleted: (at crate13 depot0) (clear crate13) (available hoist0) (on crate13 crate7)
   added: (lifting hoist0 crate13) (clear crate7)
   goals met: 0 of 13
7. (load hoist7 crate10 truck3 distributor1)
   deleted: (lifting hoist7 crate10)
   added: (in crate10 truck3) (available hoist7)
   goals met: 0 of 13
8. (load hoist0 crate13 truck2 depot0)
   deleted: (lifting hoist0 crate13)
   added: (in crate13 truck2) (available hoist0)
   goals met: 0 of 13
9. (load hoist1 crate11 truck0 depot1)
   deleted: (lifting hoist1 crate11)
   added: (in crate11 truck0) (available hoist1)
   goals met: 0 of 13
10. (lift hoist0 crate7 crate4 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate4)
   added: (lifting hoist0 crate7) (clear crate4)
   goals met: 0 of 13
11. (lift hoist2 crate14 crate12 distributor0)
   deleted: (at crate14 distributor0) (clear crate14) (available hoist2) (on crate14 crate12)
   added: (lifting hoist2 crate14) (clear crate12)
   goals met: 0 of 13
12. (lift hoist5 crate4 crate0 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist5) (on crate4 crate0)
   added: (lifting hoist5 crate4) (clear crate0)
   goals met: 0 of 13
13. (drop hoist5 crate4 pallet4 depot0)
   deleted: (lifting hoist5 crate4) (clear pallet4)
   added: (available hoist5) (at crate4 depot0) (clear crate4) (on crate4 pallet4)
   goals met: 1 of 13
14. (lift hoist5 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist5) (on crate0 pallet0)
   added: (lifting hoist5 crate0) (clear pallet0)
   goals met: 1 of 13
15. (lift hoist4 crate8 crate6 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist4) (on crate8 crate6)
   added: (lifting hoist4 crate8) (clear crate6)
   goals met: 1 of 13
16. (drive truck3 distributor1 depot0)
   deleted: (at truck3 distributor1)
   added: (at truck3 depot0)
   goals met: 1 of 13
17. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 1 of 13
18. (lift hoist1 crate1 pallet1 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   goals met: 1 of 13
19. (drive truck2 depot0 distributor1)
   deleted: (at truck2 depot0)
   added: (at truck2 distributor1)
   goals met: 1 of 13
20. (load hoist1 crate1 truck0 depot1)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   goals met: 1 of 13
21. (unload hoist7 crate13 truck2 distributor1)
   deleted: (in crate13 truck2) (available hoist7)
   added: (lifting hoist7 crate13)
   goals met: 1 of 13
22. (lift hoist6 crate6 pallet5 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist6) (on crate6 pallet5)
   added: (lifting hoist6 crate6) (clear pallet5)
   goals met: 1 of 13
23. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 1 of 13
24. (load hoist2 crate14 truck1 distributor0)
   deleted: (lifting hoist2 crate14)
   added: (in crate14 truck1) (available hoist2)
   goals met: 1 of 13
25. (load hoist6 crate6 truck1 distributor0)
   deleted: (lifting hoist6 crate6)
   added: (in crate6 truck1) (available hoist6)
   goals met: 1 of 13
26. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 1 of 13
27. (unload hoist6 crate11 truck0 distributor0)
   deleted: (in crate11 truck0) (available hoist6)
   added: (lifting hoist6 crate11)
   goals met: 1 of 13
28. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 1 of 13
29. (drop hoist3 crate3 crate9 distributor1)
   deleted: (lifting hoist3 crate3) (clear crate9)
   added: (available hoist3) (at crate3 distributor1) (clear crate3) (on crate3 crate9)
   goals met: 1 of 13
30. (lift hoist1 crate5 pallet7 depot1)
   deleted: (at crate5 depot1) (clear crate5) (available hoist1) (on crate5 pallet7)
   added: (lifting hoist1 crate5) (clear pallet7)
   goals met: 1 of 13
31. (load hoist4 crate8 truck1 distributor0)
   deleted: (lifting hoist4 crate8)
   added: (in crate8 truck1) (available hoist4)
   goals met: 1 of 13
32. (drop hoist6 crate11 pallet5 distributor0)
   deleted: (lifting hoist6 crate11) (clear pallet5)
   added: (available hoist6) (at crate11 distributor0) (clear crate11) (on crate11 pallet5)
   goals met: 2 of 13
33. (lift hoist2 crate12 crate2 distributor0)
   deleted: (at crate12 distributor0) (clear crate12) (available hoist2) (on crate12 crate2)
   added: (lifting hoist2 crate12) (clear crate2)
   goals met: 2 of 13
34. (lift hoist4 crate2 pallet2 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist4) (on crate2 pallet2)
   added: (lifting hoist4 crate2) (clear pallet2)
   goals met: 2 of 13
35. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   goals met: 2 of 13
36. (load hoist1 crate5 truck1 depot1)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck1) (available hoist1)
   goals met: 2 of 13
37. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 2 of 13
38. (unload hoist6 crate5 truck1 distributor0)
   deleted: (in crate5 truck1) (available hoist6)
   added: (lifting hoist6 crate5)
   goals met: 2 of 13
39. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 2 of 13
40. (drop hoist6 crate5 pallet2 distributor0)
   deleted: (lifting hoist6 crate5) (clear pallet2)
   added: (available hoist6) (at crate5 distributor0) (clear crate5) (on crate5 pallet2)
   goals met: 3 of 13
41. (unload hoist3 crate1 truck0 distributor1)
   deleted: (in crate1 truck0) (available hoist3)
   added: (lifting hoist3 crate1)
   goals met: 3 of 13
42. (drop hoist3 crate1 pallet6 distributor1)
   deleted: (lifting hoist3 crate1) (clear pallet6)
   added: (available hoist3) (at crate1 distributor1) (clear crate1) (on crate1 pallet6)
   goals met: 4 of 13
43. (drop hoist2 crate12 crate5 distributor0)
   deleted: (lifting hoist2 crate12) (clear crate5)
   added: (available hoist2) (at crate12 distributor0) (clear crate12) (on crate12 crate5)
   goals met: 5 of 13
44. (drop hoist4 crate2 crate12 distributor0)
   deleted: (lifting hoist4 crate2) (clear crate12)
   added: (available hoist4) (at crate2 distributor0) (clear crate2) (on crate2 crate12)
   goals met: 6 of 13
45. (drive truck3 depot0 depot1)
   deleted: (at truck3 depot0)
   added: (at truck3 depot1)
   goals met: 6 of 13
46. (unload hoist1 crate10 truck3 depot1)
   deleted: (in crate10 truck3) (available hoist1)
   added: (lifting hoist1 crate10)
   goals met: 6 of 13
47. (load hoist5 crate0 truck1 depot0)
   deleted: (lifting hoist5 crate0)
   added: (in crate0 truck1) (available hoist5)
   goals met: 6 of 13
48. (unload hoist5 crate8 truck1 depot0)
   deleted: (in crate8 truck1) (available hoist5)
   added: (lifting hoist5 crate8)
   goals met: 6 of 13
49. (drop hoist1 crate10 pallet1 depot1)
   deleted: (lifting hoist1 crate10) (clear pallet1)
   added: (available hoist1) (at crate10 depot1) (clear crate10) (on crate10 pallet1)
   goals met: 7 of 13
50. (drop hoist5 crate8 crate4 depot0)
   deleted: (lifting hoist5 crate8) (clear crate4)
   added: (available hoist5) (at crate8 depot0) (clear crate8) (on crate8 crate4)
   goals met: 8 of 13
51. (unload hoist5 crate14 truck1 depot0)
   deleted: (in crate14 truck1) (available hoist5)
   added: (lifting hoist5 crate14)
   goals met: 8 of 13
52. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 8 of 13
53. (unload hoist1 crate0 truck1 depot1)
   deleted: (in crate0 truck1) (available hoist1)
   added: (lifting hoist1 crate0)
   goals met: 8 of 13
54. (drop hoist5 crate14 pallet0 depot0)
   deleted: (lifting hoist5 crate14) (clear pallet0)
   added: (available hoist5) (at crate14 depot0) (clear crate14) (on crate14 pallet0)
   goals met: 9 of 13
55. (drop hoist1 crate0 crate10 depot1)
   deleted: (lifting hoist1 crate0) (clear crate10)
   added: (available hoist1) (at crate0 depot1) (clear crate0) (on crate0 crate10)
   goals met: 10 of 13
56. (unload hoist1 crate6 truck1 depot1)
   deleted: (in crate6 truck1) (available hoist1)
   added: (lifting hoist1 crate6)
   goals met: 10 of 13
57. (drop hoist1 crate6 pallet7 depot1)
   deleted: (lifting hoist1 crate6) (clear pallet7)
   added: (available hoist1) (at crate6 depot1) (clear crate6) (on crate6 pallet7)
   goals met: 11 of 13
58. (lift hoist3 crate3 crate9 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist3) (on crate3 crate9)
   added: (lifting hoist3 crate3) (clear crate9)
   goals met: 11 of 13
59. (drop hoist3 crate3 crate1 distributor1)
   deleted: (lifting hoist3 crate3) (clear crate1)
   added: (available hoist3) (at crate3 distributor1) (clear crate3) (on crate3 crate1)
   goals met: 11 of 13
60. (lift hoist3 crate9 pallet3 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist3) (on crate9 pallet3)
   added: (lifting hoist3 crate9) (clear pallet3)
   goals met: 11 of 13
61. (drop hoist7 crate13 pallet3 distributor1)
   deleted: (lifting hoist7 crate13) (clear pallet3)
   added: (available hoist7) (at crate13 distributor1) (clear crate13) (on crate13 pallet3)
   goals met: 12 of 13
62. (lift hoist7 crate3 crate1 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist7) (on crate3 crate1)
   added: (lifting hoist7 crate3) (clear crate1)
   goals met: 12 of 13
63. (drop hoist3 crate9 crate1 distributor1)
   deleted: (lifting hoist3 crate9) (clear crate1)
   added: (available hoist3) (at crate9 distributor1) (clear crate9) (on crate9 crate1)
   goals met: 13 of 13
